In [2]:
import pandas as pd
import numpy as np

In [5]:
#Let's add some missing data to our dataframe
data = {'first': ["Lians", "Shem",np.nan, None, 'NA', "Zainab"],
        'last': ["Wanjiku", "Githinji", np.nan, None, 'Missing', "Buno"],
        'email': ["lianswanjiku@gmail.com", "smaina@gmail.com",None, np.nan ,'Anonymous@email.com', "zainab@gmail.com"]}

In [6]:
df = pd.DataFrame(data)

In [7]:
df

    first      last                   email
0   Lians   Wanjiku  lianswanjiku@gmail.com
1    Shem  Githinji        smaina@gmail.com
2     NaN       NaN                    None
3    None      None                     NaN
4      NA   Missing     Anonymous@email.com
5  Zainab      Buno        zainab@gmail.com

In [8]:
df.dropna()

    first      last                   email
0   Lians   Wanjiku  lianswanjiku@gmail.com
1    Shem  Githinji        smaina@gmail.com
4      NA   Missing     Anonymous@email.com
5  Zainab      Buno        zainab@gmail.com

In [9]:
#Checks whether the dataframe has objects that are NAN
df.isna()

   first   last  email
0  False  False  False
1  False  False  False
2   True   True   True
3   True   True   True
4  False  False  False
5  False  False  False

In [10]:
df.fillna('Missing')

     first      last                   email
0    Lians   Wanjiku  lianswanjiku@gmail.com
1     Shem  Githinji        smaina@gmail.com
2  Missing   Missing                 Missing
3  Missing   Missing                 Missing
4       NA   Missing     Anonymous@email.com
5   Zainab      Buno        zainab@gmail.com